---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.ReverseIterator
source: html/2a5121cf-8cbf-f00c-9124-b4d20d36cb7b.htm
---
# Autodesk.Revit.DB.PaperSizeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual PaperSizeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.